tutorials/interFoam/ras/damBreak/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name from directory
application="rasInterFoam"

runApplication blockMesh
runApplication setFields
runApplication $application
